{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Diploma",
      "department": "Computer Programming",
      "duration": "2018-2021",
      "school_name": "Seneca College"
    },
    {
      "awards_achievements": null,
      "degree": "Certificate",
      "department": "Audio Engineering",
      "duration": "2014-2015",
      "school_name": "Recording Arts Canada"
    },
    {
      "awards_achievements": null,
      "degree": "Certificate",
      "department": "General Arts",
      "duration": "2012-2013",
      "school_name": "Seneca College"
    },
    {
      "awards_achievements": null,
      "degree": "Incomplete",
      "department": "Business Administration - Marketing",
      "duration": "2010-2012",
      "school_name": "Seneca College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_DavidTrumble",
  "highlighted_projects": [
    {
      "description": "Virtual Studio Technology - Low Cut, High Cut and Parametric Equalizer with Frequency and Gain control. Technologies include: C++, STL and JUCE Framework.",
      "git_url": "https://github.com/Plum-Tree-Garden/JUCE/tree/main/3BandEQ",
      "name": "3-Band Equalizer"
    },
    {
      "description": "Database storage, input and retrieval for Ministry of Health of Ontario vaccine counts. Technologies include: Java, JavaFX, Swing, AWT, JDBC and XAMPP.",
      "git_url": "https://github.com/Plum-Tree-Garden/JAVA/tree/main/JDBC3",
      "name": "Database Manager"
    },
    {
      "description": "Helps users learn typing without looking at keys. Has onscreen keyboard display and highlights keys that are being pressed. Technologies include: Java, JavaFX, Swing, AWT, JDBC and XAMPP.",
      "git_url": "https://github.com/Plum-Tree-Garden/JAVA/tree/main/typingTutor",
      "name": "Typing Tutor"
    },
    {
      "description": "Creates a simulation between 2 AI opponents in a game of Rock, Paper, Scissors; then weighs the results to determine future decisions. Technologies include: C++ and STL.",
      "git_url": "https://github.com/Plum-Tree-Garden/cpp/tree/main/RockPaperScissors",
      "name": "Weighted Learning - Rock Paper Scissors"
    },
    {
      "description": "Receive user input then quantifies the Neutrons of Gravitational Force between 2 objects on Earth. Technologies include: C++ and STL.",
      "git_url": "https://github.com/Plum-Tree-Garden/cpp/tree/main/quantify/GravitationalForce",
      "name": "Quantifying Gravitational Force"
    }
  ],
  "jarvis_projects": [
    {
      "description": "This project uses Google Cloud Platform(Compute Engine) to initialize a Virtual Machine with CentOS. Within the Virtual Machine, an instance of Docker is provisioned. A Postgresql instance is then provisioned on Docker. Data is inserted via an automated Bash/Shell script and retrieved from the RDBMS with SQL; which details hardware specifications.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "David Trumble",
  "others": [
    {
      "bullets": [
        "3rd Dan Kukkiwon"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "N/A"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Read",
        "Music",
        "Exercise"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Serve as a member and lead of the software development team. Facilitate proper design and implementation of software. Provide detailed and innovative design; creating a seamless software experience. Technologies include: Bash, Postgresql, Docker, Java and JDBC.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "Freelance - https://stormy-plateau-32984.herokuapp.com/",
      "description": "Provided Front-End website architecture, user interactions on it's web page and end-to-end service. Also, developed Back-End and managed server functionality; ensuring cross-platform optimization for mobile phones. Technologies include: HTML, CSS, BootStrap, Heroku and Express.js",
      "duration": "2021",
      "title": "Full-Stack Developer"
    },
    {
      "company": "Freelance - https://coast.edwincheungdesign.com/",
      "description": "Established and guided the websites architecture to ensure high-performance and availability; while creating extra utility functions. Managed and formulated effective, responsive designs and converted them to a working theme as a customizable, open-source eCommerce platform. Technologies include: WordPress, PHP, JavaScript, HTML and CSS.",
      "duration": "2020",
      "title": "WordPress Developer"
    },
    {
      "company": "The Noize Faktory",
      "description": "Prepared and documented all new client contracts, registrations and payments for new and on-going studio services. Instructed individual and group tutorials in: recording, production, theoretical acoustics, music composition, mixing and mastering.",
      "duration": "2014-2019",
      "title": "Program Coordinator \u0026 Audio Engineer"
    },
    {
      "company": "Captial One",
      "description": "Presented, chartered and managed concerns with account holders and employed timely solutions. Determined the validity of client statements and advised client of file procedures; clearly documenting call results and consumer account communications.",
      "duration": "2008-2009, 2012-2013",
      "title": "Account Manager \u0026 Arrears Account Specialist"
    },
    {
      "company": "CanEAST Communications",
      "description": "Developed product-relevant presentations for individuals, families, large groups and businesses. Directed sales inquiries, pricing and information as first point of contact for new and potential customers.",
      "duration": "2009-2010",
      "title": "Marketing Sales Representative"
    }
  ],
  "skills": {
    "competent": [
      "SQL Developer",
      "Node.js",
      "Postgres",
      "Heroku",
      "IBM i-series/AS400",
      "PuTTY/FileZilla/WinSCP"
    ],
    "familiar": [
      "React",
      "PHP",
      "Python",
      "Arduino",
      "MongoDB",
      "SSH/SCP/SFTP",
      "Windows/Powershell",
      "UML"
    ],
    "proficient": [
      "Java",
      "C/C++",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "HTML/CSS/BootStrap",
      "JavaScript",
      "VIM"
    ]
  },
  "summary": "My name is David Trumble; a current Software Developer of Jarvis Consulting Group. I have a Diploma in Computer Programming as well as previous industry experience freelancing as both; Full-Stack and WordPress Developer. The software industry is a challenging yet rewarding job scope for myself, it is an opportunity to: have an outlet for my creativity, learn new things, collaborate with like-minded individuals and ultimately work towards something that makes a positive lasting impact."
}
